1、实验室方向是做什么的?

看你熟悉python和C++，问你几个python的问题吧。

2、python交换数字a,b

3、python对一个列表删除所有为0的数字

4、python怎么定义一个类的成员变量

5、linux怎么删除一个进程?那么进程号怎么知道呢？(grep)

6、linux命令怎么查看硬盘太小

7、LR和SVM的区别，当聊到损失函数，问分别是什么?hinge损失函数里面的z是什么?

8、决策树里面的分类树怎么选择划分属性，给了两个属性分布情况，问选择哪个?

9、决策树做回归时候划分点怎么选择?

10、LSTM对于RNN的改进地方在哪?解决了RNN的什么问题?(梯度弥散)

11、那么RNN的梯度爆炸怎么解决?我回答能想到的就是relu函数，他不满意，说有没有通用的方法，回来查了还有正交权重矩阵等等。

12、LSTM的结构，里面的遗忘门是一个数值还是向量?维度是多少?

13、python写一个函数，实现给定一个列表，把列表所有0移到列表最后面，其余相对顺序不变，要求时间o(n)，空间o(1)

14、python写一个函数，实现有1T 的数据，10亿个不重复单词，给你一台机器，16G的内存和5T的内存，怎么统计每个单词的个数?

补充一个还有LSTM你用的优化方法是哪个，我说是Adam，他问还有哪些，我说SGD等等，他问GD和SGD的区别了

之前腾讯内推时候面了三面还自信觉得会过，后面挂了都已经没有心思再面腾讯了，面试好累啊。
————————————————
版权声明：本文为CSDN博主「牛客网」的原创文章，遵循 CC 4.0 BY-SA 版权协议，转载请附上原文出处链接及本声明。
原文链接：https://blog.csdn.net/weixin_39069037/article/details/80311638

1. 自我介绍直接介绍项目，把项目有条有理的说出来，面试官会逐个问项目的应用、原理；
2. 详细解释Itanh、Isigmoid函数的创新点；
3. ReLU有什么优缺点，带来什么后果？
4. ReLU有什么变体：leaky ReLU和Parameter ReLU？
5. LSTM与GRU在模型上面有什么区别；在参数量级上有什么区别？
6. 你知道有哪些损失函数？
7. 交叉熵损失函数和MSE之间的优劣？
8. 什么是大数定理？
9. 数学建模：现有资产A，每次投资比例为P，每次投资后有两种结果，第一种是赚一倍，概率为0.8，第二种是亏完，概率为0.2，投资N次后，请问当P为多少时，赚钱最多？
10. 面试官给出的建议：理论知识不够扎实、理论知识的实践（数学建模）能力有待提高，探究问题本质。
11. 我问的问题：应用研究岗位有哪些方面的工作？，答案：根据数据研究推荐算法；文本分类，要求有一定的编程能力。